Revit 2027 API
Stairs.MultistoryStairsId Property
 The id of the MultistoryStairs element to which this element belongs. If this stairs element is not a member of a MultistoryStairs element, this will be InvalidElementId.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MultistoryStairsId { get; }
Public ReadOnly Property MultistoryStairsId As ElementId
	Get
public:
property ElementId^ MultistoryStairsId {
	ElementId^ get ();
}
member MultistoryStairsId : ElementId with get
Property Value
ElementId
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace